{
  "backend/main.mo": "Actor with authorization and blob‑storage mixins defining data models for orphanages, programs, activities, people, documentation, media attachments, and timeline events, backed by map-based storage.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing component purposes and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling authentication state, profile setup, kid‑mode routing, and dashboard rendering with theming and toasts.",
  "frontend/src/components/activities/ActivityDialog.tsx": "Dialog for creating and editing activities with status, program/orphanage selection, owner info, and full attachment management.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper that checks admin status and shows either restricted-access messaging or protected children.",
  "frontend/src/components/auth/AuthGate.tsx": "Temporary permissive authorization gate that renders children for all authenticated users.",
  "frontend/src/components/auth/LoginCard.tsx": "Login UI card handling Internet Identity authentication with loading and error recovery.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for entering and submitting a new user’s name to create their profile with a default role.",
  "frontend/src/components/common/ArchiveConfirmDialog.tsx": "Reusable confirmation dialog for archiving items with pending-state handling.",
  "frontend/src/components/common/ImagePreviewDialog.tsx": "Dialog that previews an image and allows closing or downloading it.",
  "frontend/src/components/common/OwnerIndicator.tsx": "Displays a user or principal with an avatar showing initials and optional name.",
  "frontend/src/components/documentation/DocumentationEntryDialog.tsx": "Form dialog for creating or editing documentation entries, including activity selection, content editing, and attachment management.",
  "frontend/src/components/kidMode/KidModeLayout.tsx": "Layout for kid mode with navigation between assigned programs and attachments, plus exit controls.",
  "frontend/src/components/kidMode/KidModeSelector.tsx": "Selects a kid profile for kid mode, auto-selecting when only one profile exists.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Main dashboard layout with side navigation and dynamic section rendering.",
  "frontend/src/components/layout/Header.tsx": "Dashboard header showing current section and user menu with logout.",
  "frontend/src/components/layout/SideNav.tsx": "Renders the dashboard side navigation with section buttons and an admin-only option based on user permissions.",
  "frontend/src/components/orphanages/OrphanageDialog.tsx": "Provides a form dialog for creating or editing orphanage records with validation and mutation calls.",
  "frontend/src/components/people/PersonDialog.tsx": "Displays a dialog for adding or viewing a person, handling basic validation and create operations.",
  "frontend/src/components/programs/MyFocusTodaySection.tsx": "Shows the current user's open activities and next upcoming events with loading states.",
  "frontend/src/components/programs/ProgramDialog.tsx": "A comprehensive dialog for creating or editing programs, including attachments, images, and admin‑restricted actions.",
  "frontend/src/components/programs/ProgramImagePreviewDialog.tsx": "Displays an image preview dialog with options to close or download the file.",
  "frontend/src/components/programs/ProgramScheduleCalendar.tsx": "Renders a monthly calendar for a program, displaying schedule events and allowing admins to add or archive events.",
  "frontend/src/components/programs/ScheduleEventDialog.tsx": "Dialog form for creating schedule events, handling input, validation, timestamp construction, and submission.",
  "frontend/src/components/sprint/SprintBoardCard.tsx": "Displays an activity card in a sprint board with program info, owner, status, and optional detailed fields.",
  "frontend/src/components/sprint/SprintBoardColumn.tsx": "Represents a sprint board column with activities, drag-and-drop movement, and activity rendering.",
  "frontend/src/constants/activityStatuses.ts": "Defines activity status constants, display colors, and column configurations for simple and detailed board views.",
  "frontend/src/hooks/data/useActivities.ts": "React Query hooks for listing, creating, updating, and archiving activities with backend integration and cache updates.",
  "frontend/src/hooks/data/useActivityAttachments.ts": "Provides hooks for listing, uploading, downloading, and deleting activity attachments, including chunked file uploads.",
  "frontend/src/hooks/data/useAdminUsers.ts": "React-query hooks for listing users, updating user roles, and fetching individual user profiles via the actor API.",
  "frontend/src/hooks/data/useDocumentation.ts": "Provides hooks to query, search, create, and archive documentation entries with cache invalidation.",
  "frontend/src/hooks/data/useDocumentationAttachments.ts": "Manages listing, uploading, downloading, fetching bytes, and archiving documentation attachments with chunked upload support.",
  "frontend/src/hooks/data/useOperationalVisibility.ts": "Fetches program timelines and upcoming schedule events from the backend with sorting and optional time windows.",
  "frontend/src/hooks/data/useOrphanages.ts": "Hooks for listing, fetching, creating, updating, and archiving orphanages with fallback to sample data.",
  "frontend/src/hooks/data/usePeople.ts": "Handles listing, searching, creating, and archiving people records filtered to active, non-archived entries.",
  "frontend/src/hooks/data/useProgramAttachments.ts": "Supports listing, uploading, downloading, and filtering program media attachments with chunked uploads and cache invalidation.",
  "frontend/src/hooks/data/usePrograms.ts": "Provides hooks to list, create, update, and archive programs with fallback sample data and timeline invalidation.",
  "frontend/src/hooks/data/useScheduleEvents.ts": "Enables listing, creating, and archiving schedule events per program with related cache updates.",
  "frontend/src/hooks/kidMode/useKidContext.ts": "Kid profile hooks for listing, fetching, selecting, and clearing active kid context using react-query.",
  "frontend/src/hooks/kidMode/useKidPrograms.ts": "Hooks to fetch kid-assigned programs and media attachments based on the active kid context.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Provides hooks for fetching and updating the caller’s user profile, role, and admin status.",
  "frontend/src/hooks/queries/useUserProfiles.ts": "Hooks to fetch one or many user profiles by principal with caching and safe fallbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling login, logout, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom hook syncing a React state value with sessionStorage.",
  "frontend/src/index.css": "Tailwind CSS base config with light/dark theme variables and global styles.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names with clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/activities/ActivitiesPage.tsx": "Activities management page with filtering, creation, archiving, and owner profile lookup.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Lists user accounts for admins and allows updating user roles with feedback handling.",
  "frontend/src/pages/documentation/DocumentationPage.tsx": "Displays, filters, creates, views, and archives documentation entries with search and activity filtering.",
  "frontend/src/pages/kidMode/AssignedProgramsPage.tsx": "Shows a kid’s assigned programs and lets them open the attachments for each program.",
  "frontend/src/pages/kidMode/ProgramAttachmentsPage.tsx": "Lists a program’s attachments, allowing kids to preview images or download files.",
  "frontend/src/pages/organizations/OrganizationsPage.tsx": "Manages orphanages with search, creation, editing, and archiving.",
  "frontend/src/pages/people/PeoplePage.tsx": "Manages people records with search, role filtering, creation, viewing, and archiving.",
  "frontend/src/pages/programs/ProgramsPage.tsx": "Renders the programs management page with search, creation, editing, archiving, and a focus-today section. Handles program CRUD actions and displays program cards with dialogs.",
  "frontend/src/pages/sprint/SprintBoardPage.tsx": "Displays a Kanban-style sprint board with simple and detailed views, filtering, and activity status updates. Supports viewing and editing activities with authentication and sample-data restrictions.",
  "frontend/src/pages/visibility/OperationalVisibilityPage.tsx": "Shows upcoming events and timeline data for selected programs with error-handling toasts and user profile lookups. Provides a program selector and formatted visibility information.",
  "frontend/src/sampleData/sampleData.ts": "Defines sample programs and orphanages used as demo data with detailed fields for display or fallback purposes.",
  "frontend/src/utils/chunkedUpload.ts": "Implements chunked file upload logic with size thresholds, error handling, and progress reporting, falling back to single-call uploads for small files.",
  "frontend/src/utils/mutationFeedback.ts": "Provides standardized success and error toast helpers plus logic to convert technical upload and network errors into user-friendly messages.",
  "frontend/src/utils/timelineEventFormatter.ts": "Converts timeline event types into readable messages using the actor’s name when available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Project state metadata describing outstanding chunked-upload tasks, issues, and a required no‑op backend module."
}