{
  "backend/main.mo": "Motoko canister actor defining core data models (orphanages, programs, activities, people, media, schedules, kids, timeline events) and persistent storage maps, composed with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report describing two high-confidence frontend-only features for adding and populating a \"My focus today\" section on the Programs page, including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten JSON-style map summarizing the purpose of many frontend React components, pages, hooks, and utilities across authentication, dashboard layout, programs, activities, and admin features.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color themes (light/dark), sidebar variables, and base styles for the application.",
  "frontend/index.html": "HTML entry point that defines the root element and loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component that orchestrates authentication, profile setup, kid mode selection, and routing between login, kid mode, and the internal dashboard with theming and toasts.",
  "frontend/src/components/activities/ActivityDialog.tsx": "Modal dialog for creating and editing activities, handling form state, validation, program/orphanage selection, and mutations for create or status update.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper component that conditionally renders children only for admin users, showing a loading spinner or access-denied card otherwise.",
  "frontend/src/components/auth/AuthGate.tsx": "Authorization gate that blocks access for guests or undefined roles and displays an access-denied message before rendering protected content.",
  "frontend/src/components/auth/LoginCard.tsx": "Renders a login card that authenticates users via Internet Identity, handling loading state and retrying when already authenticated.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts a new user to enter their name and creates a default user profile via a mutation, with basic validation and toasts.",
  "frontend/src/components/common/ArchiveConfirmDialog.tsx": "Reusable confirmation dialog for archiving actions, showing title/description and disabling actions while a pending state is active.",
  "frontend/src/components/documentation/DocumentationEntryDialog.tsx": "Dialog for creating or viewing a documentation entry tied to an activity, including activity selection, content input, validation, and submission logic.",
  "frontend/src/components/kidMode/KidModeLayout.tsx": "Main layout for Kid Mode that manages navigation between assigned programs and attachments, displays a kid-friendly header, and allows exiting Kid Mode.",
  "frontend/src/components/kidMode/KidModeSelector.tsx": "Handles listing and selecting kid profiles, with auto-selection for a single profile and fallback UI for loading or no profiles.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Top-level dashboard layout that manages section state and renders the corresponding page with a side navigation and header.",
  "frontend/src/components/layout/Header.tsx": "Dashboard header showing the current section title and a user menu with profile info and sign-out functionality.",
  "frontend/src/components/layout/SideNav.tsx": "Renders the dashboard side navigation with section buttons and icons, highlighting the current section. Conditionally shows an Admin section based on the caller's admin status.",
  "frontend/src/components/orphanages/OrphanageDialog.tsx": "Dialog form for creating or editing orphanage records with validation and submission via data hooks. Manages extensive orphanage fields and shows success/error toasts.",
  "frontend/src/components/people/PersonDialog.tsx": "Dialog for adding or viewing a person, allowing creation with name, contact, and role. Editing mode is read-only and creation uses a people data hook with error handling.",
  "frontend/src/components/programs/MyFocusTodaySection.tsx": "Dashboard card showing the current user's open activities and the next few upcoming events. Fetches activities and events, handles loading state, and filters by the logged-in identity.",
  "frontend/src/components/programs/ProgramDialog.tsx": "Comprehensive dialog for creating or editing programs, including metadata fields, schedules, and attachment management (documents and images). Supports admin-only actions, uploads, previews, downloads, and archival of attachments.",
  "frontend/src/components/programs/ProgramImagePreviewDialog.tsx": "Modal dialog that previews a program image attachment with options to close or download the file.",
  "frontend/src/components/programs/ProgramScheduleCalendar.tsx": "Renders a monthly calendar for a program showing scheduled events, with navigation, event listing per day, and admin-only interactions to create or archive events.",
  "frontend/src/components/programs/ScheduleEventDialog.tsx": "Modal dialog for creating a new schedule event, handling form state, date/time parsing, timestamp conversion, and submission via a create-event hook.",
  "frontend/src/components/sprint/SprintBoardCard.tsx": "Displays an individual activity card in the sprint board, showing title, program, status, and optional drag handle and detailed metadata.",
  "frontend/src/components/sprint/SprintBoardColumn.tsx": "Represents a sprint board column containing draggable activity cards, handling drag-and-drop status changes and column-level layout.",
  "frontend/src/constants/activityStatuses.ts": "Defines activity status constants, types, color mappings, and column configurations for simple and detailed sprint board views.",
  "frontend/src/hooks/data/useActivities.ts": "Provides React Query hooks to list, create, update status, and archive activities, including sample data fallback and cache invalidation.",
  "frontend/src/hooks/data/useAdminUsers.ts": "Contains admin-related hooks for fetching users (stubbed), updating user roles, and retrieving individual user profiles via the backend actor.",
  "frontend/src/hooks/data/useDocumentation.ts": "Supplies hooks to list, search, create, and archive documentation entries tied to activities, with appropriate query filtering and cache invalidation.",
  "frontend/src/hooks/data/useOperationalVisibility.ts": "Provides React Query hooks to fetch a program timeline and upcoming schedule events, gated by actor availability and optionally a time window.",
  "frontend/src/hooks/data/useOrphanages.ts": "Defines hooks to list, fetch, create, update, and archive orphanages, with filtering for active records and fallback to sample data when none exist.",
  "frontend/src/hooks/data/usePeople.ts": "Contains hooks to list active people, search people by name, create new people, and archive people, with React Query cache invalidation.",
  "frontend/src/hooks/data/useProgramAttachments.ts": "Implements hooks to list, filter, and upload program media attachments (documents/images), including query invalidation, with download functionality stubbed out.",
  "frontend/src/hooks/data/usePrograms.ts": "Provides hooks to list active programs (with sample fallback) and to create, update, or archive programs while keeping related queries in sync.",
  "frontend/src/hooks/data/useScheduleEvents.ts": "Defines hooks to list schedule events by program and to create or archive events, invalidating upcoming events and program timelines.",
  "frontend/src/hooks/kidMode/useKidContext.ts": "Manages kid mode context with hooks to list a user's kid profiles, get the active kid, and select or clear the active kid context.",
  "frontend/src/hooks/kidMode/useKidPrograms.ts": "Provides kid-mode hooks to fetch programs and program attachments accessible to the currently active kid context.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Exposes hooks to fetch the current caller's user profile, role, and admin status, and to save profile updates.",
  "frontend/src/hooks/queries/useUserProfiles.ts": "Includes hooks to fetch one or multiple user profiles by principal with caching and access-safe fallbacks, plus a helper for display names.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and caches a backend actor based on the current Internet Identity, initializing access control when authenticated and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Dfinity Internet Identity, managing login/logout, persisted identity loading, and detailed login status flags via AuthClient.",
  "frontend/src/hooks/useSessionStorageState.ts": "Defines a generic React hook that syncs component state to sessionStorage, initializing from storage and persisting updates automatically.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines extensive CSS variables for light and dark theme color palettes, base styles, and chart colors.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge conditional class names using clsx and tailwind-merge for Tailwind-friendly styling.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/activities/ActivitiesPage.tsx": "Renders the activity log UI with filtering, searching, creation, viewing, and archiving of activities, integrating authentication checks and data hooks.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin-only page for viewing users and updating their roles, with loading states, error handling, and role selection UI.",
  "frontend/src/pages/documentation/DocumentationPage.tsx": "Displays and manages documentation entries linked to activities, supporting search, filtering, creation, viewing, and archiving with confirmation and toasts.",
  "frontend/src/pages/kidMode/AssignedProgramsPage.tsx": "Kid-facing page that fetches and displays programs assigned to the child, showing loading and empty states. Renders program cards with descriptions, objectives, and a button to view program materials.",
  "frontend/src/pages/kidMode/ProgramAttachmentsPage.tsx": "Kid-facing page for viewing and downloading attachments for a specific program. Separates documents and images, handles downloads with toasts, and includes loading and empty states with a back navigation.",
  "frontend/src/pages/organizations/OrganizationsPage.tsx": "Admin page for managing orphanage organizations, including listing, searching, creating, editing, and archiving orphanages. Uses dialogs for create/edit and confirmation for archiving with loading and empty states.",
  "frontend/src/pages/people/PeoplePage.tsx": "Admin page to manage people records with search and role-based filtering, creation/editing, and archiving. Handles permissions and errors with dialogs, toasts, and loading states.",
  "frontend/src/pages/programs/ProgramsPage.tsx": "Admin page for creating, searching, and archiving educational programs, with an added \"My Focus Today\" section and informational alerts. Uses dialogs for program management and handles authorization errors.",
  "frontend/src/pages/sprint/SprintBoardPage.tsx": "Kanban-style sprint board showing activities across programs, supporting simple and detailed views. Allows authenticated users to move activities between statuses, with sample-data protection and status update handling.",
  "frontend/src/pages/visibility/OperationalVisibilityPage.tsx": "React page that shows operational visibility with upcoming events for the next 7 days and a per-program activity timeline, including program selection, actor name resolution, loading states, and error toasts.",
  "frontend/src/sampleData/sampleData.ts": "Provides hardcoded sample data for Programs and Orphanages, used for development or demos, including detailed metadata like objectives, schedules, budgets, capacities, and constraints.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters (including hash-based routing), persist them in sessionStorage, retrieve or clear them, and safely manage navigation-related state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions (colors, fonts, radii, animations), dark mode behavior, content paths, and plugins like typography, container queries, and animations.",
  "project_state.json": "Machine-readable snapshot of the overall project state describing Namaa.Edu’s purpose, architecture, and a catalog of implemented features with versions and descriptions."
}