{
  "backend/main.mo": "Motoko canister defining core domain models (orphanages, programs, activities, people, documentation, media, schedules, kid profiles) with persistent Map-based storage, access control, blob storage, and kid context session state.",
  "feature_evidence.json": "Feature evidence report describing frontend kid-mode flows and layouts, listing affected files, dependencies, test requirements, and confidence levels for two kid-mode features.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend source files covering authentication, admin access, dashboard layout, program/activity management, documentation, and kid-mode related components and hooks.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, light/dark theme variables, and base styles for the application.",
  "frontend/index.html": "HTML entry point that mounts the React application to the root div and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component orchestrating authentication, profile setup, kid-mode selection, and conditional rendering between kid mode layout and internal dashboard.",
  "frontend/src/components/activities/ActivityDialog.tsx": "Modal dialog for creating and editing activities with program and orphanage selection, status management, validation, and backend mutations.",
  "frontend/src/components/auth/AdminOnly.tsx": "Wrapper component that conditionally renders children only for admin users, otherwise showing an admin-access-required message.",
  "frontend/src/components/auth/AuthGate.tsx": "Authorization gate that blocks guest or undefined roles from accessing protected content and displays an access-denied card.",
  "frontend/src/components/auth/LoginCard.tsx": "Renders a login card that authenticates users via Internet Identity, showing loading state and handling re-login edge cases by clearing query cache.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to enter their name and create a default user profile, with validation and success/error toasts.",
  "frontend/src/components/common/ArchiveConfirmDialog.tsx": "Reusable confirmation dialog for archiving actions, displaying a title, description, and pending state for the confirm button.",
  "frontend/src/components/documentation/DocumentationEntryDialog.tsx": "Dialog for creating or viewing a documentation entry, allowing activity selection and content entry, with permission checks and backend mutation.",
  "frontend/src/components/kidMode/KidModeLayout.tsx": "Main layout for Kid Mode, showing a kid-friendly header, navigation between programs and attachments, and controls to exit Kid Mode.",
  "frontend/src/components/kidMode/KidModeSelector.tsx": "Handles selection of a kid profile, auto-selecting when only one exists and rendering loading, empty, or multi-profile selection states.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Top-level dashboard layout managing the current section state and rendering the corresponding page with side navigation and header.",
  "frontend/src/components/layout/Header.tsx": "Dashboard header displaying the current section title, user avatar and profile info, and providing a sign-out action.",
  "frontend/src/components/layout/SideNav.tsx": "Sidebar navigation listing dashboard sections with icons, highlighting the active section and conditionally showing admin options.",
  "frontend/src/components/orphanages/OrphanageDialog.tsx": "Modal dialog for creating or editing orphanage records with form validation, state management, and create/update mutations, including capacity and occupancy handling.",
  "frontend/src/components/people/PersonDialog.tsx": "Dialog component to add a new person (volunteer/facilitator/etc.) with basic fields, validation, and a create-person mutation; editing is view-only.",
  "frontend/src/components/programs/ProgramDialog.tsx": "Comprehensive dialog for creating or editing programs, managing program details, documents, images, schedules, and attachments with admin-only actions and previews.",
  "frontend/src/components/programs/ProgramImagePreviewDialog.tsx": "Simple dialog to preview a program image attachment with options to close or download the file.",
  "frontend/src/components/programs/ProgramScheduleCalendar.tsx": "Monthly calendar view for a program’s schedule events, allowing admins to add or archive events and navigate between months.",
  "frontend/src/components/programs/ScheduleEventDialog.tsx": "Dialog for creating a schedule event for a program, collecting date, time, and details and submitting via a create-event mutation.",
  "frontend/src/components/sprint/SprintBoardCard.tsx": "Card component representing an activity on a sprint board, showing title, program, status, and optional drag handle and detailed metadata.",
  "frontend/src/components/sprint/SprintBoardColumn.tsx": "React component rendering a sprint board column with draggable activity cards, handling drag-and-drop status changes and authentication checks.",
  "frontend/src/constants/activityStatuses.ts": "Defines activity status constants, types, color mappings, and column configurations for simple and detailed sprint board views.",
  "frontend/src/hooks/data/useActivities.ts": "React Query hooks to list, create, update status, and archive activities via the backend actor, with fallback to sample data when empty.",
  "frontend/src/hooks/data/useAdminUsers.ts": "Admin-focused hooks for querying users (stubbed), updating user roles, and fetching individual user profiles through the backend actor.",
  "frontend/src/hooks/data/useDocumentation.ts": "Hooks for listing, searching, creating, and archiving documentation entries, scoped by activity and backed by React Query caching.",
  "frontend/src/hooks/data/useOrphanages.ts": "Hooks to list, fetch, create, update, and archive orphanages, filtering active records and falling back to sample data when needed.",
  "frontend/src/hooks/data/usePeople.ts": "Hooks for listing, searching, creating, and archiving people records, filtering by active and non-archived status.",
  "frontend/src/hooks/data/useProgramAttachments.ts": "Hooks to list program attachments, documents, and images, upload new media, and placeholders for download/archive functionality pending backend support.",
  "frontend/src/hooks/data/usePrograms.ts": "Hooks to list, create, update, and archive programs via the backend actor, with sample data fallback when no active programs exist.",
  "frontend/src/hooks/data/useScheduleEvents.ts": "Provides React Query hooks to list, create, and archive schedule events for a program, backed by actor API calls and cache invalidation.",
  "frontend/src/hooks/kidMode/useKidContext.ts": "Defines hooks to list kid profiles, fetch the active kid context, and select or clear a kid context, with query invalidation on changes.",
  "frontend/src/hooks/kidMode/useKidPrograms.ts": "Exposes hooks to fetch programs and program media attachments available to the active kid context, relying on backend access checks.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Contains hooks to fetch the current caller’s user profile, role, admin status, and to save profile updates via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the current Internet Identity, handling authentication, admin token setup, and query invalidation on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Internet Identity, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useSessionStorageState.ts": "Utility hook that syncs React state with sessionStorage, providing persistence with safe read/write handling.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, color themes for light and dark modes, and base element styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge and conditionally apply Tailwind and CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/activities/ActivitiesPage.tsx": "UI page for listing, filtering, creating, viewing, and archiving activities, integrating data hooks, authentication checks, and interactive dialogs.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin-only page that lists users and allows changing their roles via a dropdown, using admin data hooks. Handles loading, empty states, permission errors, and shows role badges.",
  "frontend/src/pages/documentation/DocumentationPage.tsx": "Page for listing, searching, filtering, creating, viewing, and archiving documentation entries tied to activities. Uses dialogs for entry management and confirmation, with toast feedback.",
  "frontend/src/pages/kidMode/AssignedProgramsPage.tsx": "Kid mode page that displays programs assigned to the user, with loading and empty states. Allows navigating to view program materials via a callback.",
  "frontend/src/pages/kidMode/ProgramAttachmentsPage.tsx": "Kid mode page for viewing and downloading a program’s attachments, grouped into documents and images. Supports downloading files with feedback and navigation back to programs.",
  "frontend/src/pages/organizations/OrganizationsPage.tsx": "Page for managing orphanage organizations, including search, create, edit, and archive actions. Displays orphanages in a grid with dialogs and confirmation flows.",
  "frontend/src/pages/people/PeoplePage.tsx": "Page for managing people records with search and role filtering, plus create, view/edit, and archive actions. Uses dialogs, confirmation prompts, and permission-aware error handling.",
  "frontend/src/pages/programs/ProgramsPage.tsx": "React page for listing, searching, creating, editing, and archiving Programs using data hooks, dialogs, and confirmation flows, with loading states and permission-aware error handling.",
  "frontend/src/pages/sprint/SprintBoardPage.tsx": "Kanban-style Sprint Board page that displays Activities across status columns, supports simple/detailed views, drag-style status updates, and enforces authentication and sample-data restrictions.",
  "frontend/src/sampleData/sampleData.ts": "Defines static sample seed data for Programs and Orphanages (and related entities) used to demonstrate the app’s workflow on first run, marked as non-editable sample content.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query or hash, persisting them in sessionStorage, and safely clearing sensitive parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme tokens, color system, typography, animations, plugins, and container settings for the app’s design system.",
  "project_state.json": "Versioned project metadata capturing overall vision, schema, and a structured list of implemented features, requirements alignment, and current project state."
}