{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 2.1 Dashboard UX: focus block, ownership visibility, filters, trust signals, timeline labels, attachment guardrails",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render an additive “My focus today” section above existing content on the Programs page without reordering/removing existing blocks.",
      "acceptanceCriteria": [
        "Programs page renders a new top section titled “My focus today” above the current “Manage Programs” header/alert/search UI.",
        "The existing Programs page content remains present and in the same order beneath the new section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/programs/ProgramsPage.tsx",
          "operation": "modify",
          "description": "Add a new top-of-page block titled “My focus today” rendered before the existing “Manage Programs” header/alert/search and keep all existing blocks below unchanged."
        },
        {
          "path": "frontend/src/components/programs/MyFocusTodaySection.tsx",
          "operation": "create",
          "description": "Create a reusable read-only section component for “My focus today” to be placed on ProgramsPage (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Populate “My focus today” with read-only lists for caller-owned open activities and upcoming events using existing hooks (UI-only).",
      "acceptanceCriteria": [
        "“My open activities” shows only activities where Activity.owner equals the current caller principal and Activity.isArchived is false.",
        "“Upcoming events” renders a small list of the soonest events from useUpcomingEvents (no requirement to filter by participant since the model does not support it).",
        "Both lists have clear empty states in English (e.g., “No open activities assigned to you” / “No upcoming events”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/programs/MyFocusTodaySection.tsx",
          "operation": "modify",
          "description": "Implement the two read-only lists: (1) “My open activities” by consuming useActivities and filtering to current caller ownership (principal match) and non-archived; (2) “Upcoming events” by consuming useUpcomingEvents and showing a small soonest-first subset with clear English empty states (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/programs/ProgramsPage.tsx",
          "operation": "modify",
          "description": "Wire MyFocusTodaySection to ProgramsPage and ensure it passes/derives current caller principal safely (identity missing => show empty states) while keeping this change UI-only."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show Activity owner labels on Activities page cards and Sprint Board cards using profile name resolution with safe fallbacks.",
      "acceptanceCriteria": [
        "Each activity card in ActivitiesPage includes an owner label (name when available; otherwise a safe fallback such as a shortened principal or “Unknown”).",
        "Each sprint board card includes the same owner label behavior.",
        "No backend schema/API changes are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useUserProfiles.ts",
          "operation": "modify",
          "description": "Extend existing profile lookup helpers with a safe owner display formatter (e.g., name when available; otherwise a shortened principal; otherwise “Unknown”) to reuse across ActivitiesPage and SprintBoardCard."
        },
        {
          "path": "frontend/src/pages/activities/ActivitiesPage.tsx",
          "operation": "modify",
          "description": "Resolve and display an owner label on each activity card by collecting unique Activity.owner principals, using useGetUserProfiles, and rendering the helper-derived display name with a safe fallback."
        },
        {
          "path": "frontend/src/components/sprint/SprintBoardCard.tsx",
          "operation": "modify",
          "description": "Add an owner label to sprint board activity cards using the same user profile resolution pattern (useGetUserProfiles in the parent surface or a lightweight profile lookup pattern) and the shared helper fallback behavior."
        },
        {
          "path": "frontend/src/components/sprint/SprintBoardColumn.tsx",
          "operation": "modify",
          "description": "Wire owner profile resolution for the column’s activities (dedupe owners and fetch profiles once per column render) and pass the resolved owner label (or principal) down to SprintBoardCard to avoid per-card redundant queries."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a local “Mine only” filter control on Activities page to show only caller-owned activities without changing global defaults.",
      "acceptanceCriteria": [
        "ActivitiesPage includes a “Mine only” toggle/checkbox/button that clearly indicates on/off state.",
        "When enabled, only activities owned by the current user are shown (in addition to existing search/status/orphanage filters).",
        "When disabled, existing filtering behavior is unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/activities/ActivitiesPage.tsx",
          "operation": "modify",
          "description": "Add a local “Mine only” control (English label, clear on/off state) and update filtering so that when enabled it additionally filters to Activity.owner matching the current caller principal; when disabled, preserve existing search/status/orphanage filtering behavior."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Standardize trust signals for key mutation flows: consistent pending/disabled states and English success/error toasts for Activity and Documentation mutations.",
      "acceptanceCriteria": [
        "When a save/update mutation is pending, the primary action button is disabled and a visible loading indicator/state is shown.",
        "On successful completion of Activity and Documentation mutations, a success toast is shown in English (e.g., “Activity updated”, “Documentation saved”).",
        "On mutation failure, user-facing error toasts are shown in English and do not expose raw trap strings when avoidable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/activities/ActivityDialog.tsx",
          "operation": "modify",
          "description": "Ensure the primary submit action has consistent disabled + visible loading state during create/status-update mutations, and standardize success toasts in English for create and status updates; improve error toasts to avoid raw trap strings when possible."
        },
        {
          "path": "frontend/src/pages/sprint/SprintBoardPage.tsx",
          "operation": "modify",
          "description": "Standardize status-change trust signals for drag/move: prevent repeated status updates while a mutation is pending (e.g., ignore moves while pending) and show clear English success/error toasts without exposing raw trap strings."
        },
        {
          "path": "frontend/src/hooks/data/useDocumentation.ts",
          "operation": "modify",
          "description": "Add a frontend update mutation hook for documentation entries (updateDocumentationEntry) with proper cache invalidation to support documentation update flows with consistent trust signals."
        },
        {
          "path": "frontend/src/components/documentation/DocumentationEntryDialog.tsx",
          "operation": "modify",
          "description": "Add an edit/save flow for existing entries (when entry is provided) using the new update hook, including disabled/loading primary action and explicit English success/error toasts (e.g., “Documentation saved”)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Replace mechanical timeline eventType formatting with human-readable English labels on Operational Visibility timeline with safe fallbacks.",
      "acceptanceCriteria": [
        "Known timeline event types (e.g., ProgramCreated, ActivityUpdated, AttachmentUploaded, ScheduleEventCreated) display a clear English label (e.g., “Program created”, “Activity updated”, etc.).",
        "Unknown event types continue to render in a safe fallback format (no crashes).",
        "No backend changes are required for this improvement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/visibility/OperationalVisibilityPage.tsx",
          "operation": "modify",
          "description": "Introduce a human-readable label mapper for known timeline eventType strings (e.g., ProgramCreated → “Program created”) and use it in timeline rendering; keep a safe fallback for unknown types to avoid crashes."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add attachment download guardrails by hiding/disabling download actions and showing clear English messaging where downloads/bytes are not implemented.",
      "acceptanceCriteria": [
        "Any UI that currently presents a download action for program attachments (including image preview flows and kid-mode attachments) does not lead to a broken experience (no uncaught errors / no dead buttons).",
        "If a download is attempted or visible, the UI communicates clearly in English that downloads are not available yet (e.g., “Download not available yet”).",
        "No backend attachment byte storage or download APIs are added in this phase."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/data/useProgramAttachments.ts",
          "operation": "modify",
          "description": "Centralize a UI-facing guardrail for attachment downloads/bytes being unavailable (e.g., exported capability flag and/or friendly error messages) so UI surfaces can hide/disable download and preview-byte actions without triggering broken flows."
        },
        {
          "path": "frontend/src/components/programs/ProgramDialog.tsx",
          "operation": "modify",
          "description": "Disable or hide download actions for documents/images and prevent thumbnail-bytes fetch attempts while downloads/bytes are unavailable; show a clear English message such as “Download not available yet” instead of surfacing thrown errors."
        },
        {
          "path": "frontend/src/components/programs/ProgramImagePreviewDialog.tsx",
          "operation": "modify",
          "description": "Remove or disable the Download action when downloads are unavailable and show clear English messaging within the dialog (e.g., “Download not available yet”) so preview flows do not present broken actions."
        },
        {
          "path": "frontend/src/pages/kidMode/ProgramAttachmentsPage.tsx",
          "operation": "modify",
          "description": "Disable or hide kid-mode attachment download buttons when downloads are unavailable and show clear English messaging (inline and/or toast on attempt) indicating “Download not available yet,” avoiding broken mutation calls."
        }
      ]
    }
  ]
}